app/controllers/clientes_controller.rb

  def show
    @productos = @cliente.producto.all
---
SELECT "productos".* FROM "productos" INNER JOIN "vens" ON "productos"."id" = "vens"."producto_id" WHERE "vens"."cliente_id" = ?  [["cliente_id", 1]]

  def create
    @cliente = Cliente.new(cliente_params)

    respond_to do |format|
      if @cliente.save
---
INSERT INTO "clientes" ("apellidoM", "apellidoP", "comuna", "created_at", "direccion", "nombre", "rut", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)