app/controllers/empresas_controller.rb

  def index
    @empresas = Empresa.all
---
SELECT "empresas".* FROM "empresas"

  def create
    @empresa = Empresa.new(empresa_params)

    respond_to do |format|
      if @empresa.save
---
INSERT INTO "empresas" ("created_at", "direccion", "nombre", "rubro", "rut", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2015-10-21 00:47:56.881849"], ["direccion", "22"], ["nombre", "22"], ["rubro", "22"], ["rut", "222"], ["updated_at", "2015-10-21 00:47:56.881849"]]

  def update
    respond_to do |format|
      if @empresa.update(empresa_params)
---
UPDATE "empresas" SET "direccion" = ?, "updated_at" = ? WHERE "empresas"."id" = 1  [["direccion", "uruguayE"], ["updated_at", "2015-10-23 23:25:59.372089"]]

  def destroy
    @empresa.destroy
---
DELETE FROM "empresas" WHERE "empresas"."id" = ?  [["id", 1]]

    def set_empresa
      @empresa = Empresa.find(params[:id])
---
SELECT  "empresas".* FROM "empresas"  WHERE "empresas"."id" = ? LIMIT 1  [["id", 1]]