app/controllers/vendedors_controller.rb

  def index
    @vendedors = Vendedor.all
---
SELECT "vendedors".* FROM "vendedors"

  def show
    @productos = @vendedor.producto.all
    @clientes = @vendedor.cliente.all
---
SELECT "productos".* FROM "productos" INNER JOIN "vens" ON "productos"."id" = "vens"."producto_id" WHERE "vens"."vendedor_id" = ?  [["vendedor_id", 1]]
SELECT "clientes".* FROM "clientes" INNER JOIN "vens" ON "clientes"."id" = "vens"."cliente_id" WHERE "vens"."vendedor_id" = ?  [["vendedor_id", 1]]

  def create
    @vendedor = Vendedor.new(vendedor_params)

    respond_to do |format|
      if @vendedor.save
---
INSERT INTO "vendedors" ("apellidoM", "apellidoP", "correo", "created_at", "nombre", "rut", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["apellidoM", "2323"], ["apellidoP", "2323"], ["correo", "2323"], ["created_at", "2015-10-21 00:59:12.045127"], ["nombre", ""], ["rut", "3323"], ["updated_at", "2015-10-21 00:59:12.045127"]]

  def destroy
    @vendedor.destroy
---
DELETE FROM "vendedors" WHERE "vendedors"."id" = ?  [["id", 1]]

    def set_vendedor
      @vendedor = Vendedor.find(params[:id])
---
SELECT  "vendedors".* FROM "vendedors"  WHERE "vendedors"."id" = ? LIMIT 1  [["id", 1]]