app/controllers/vens_controller.rb

  def index
    @vens = Ven.all
---
SELECT "vens".* FROM "vens"

  def create
    @ven = Ven.new(ven_params)
    @ven.save
---
INSERT INTO "vens" ("cantidad", "cliente_id", "created_at", "producto_id", "updated_at", "vendedor_id") VALUES (?, ?, ?, ?, ?, ?)  [["cantidad", 100], ["cliente_id", 1], ["created_at", "2015-10-24 15:55:49.364253"], ["producto_id", 4], ["updated_at", "2015-10-24 15:55:49.364253"], ["vendedor_id", 1]]

    def set_ven
      @ven = Ven.find(params[:id])
---
SELECT  "vens".* FROM "vens"  WHERE "vens"."id" = ? LIMIT 1  [["id", 1]]